index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>p2peace</title>
<meta name="author" content="(p2peace)"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

<link rel="stylesheet" href="https://p2peace.github.io/js/reveal.js/css/reveal.min.css"/>
<link rel="stylesheet" href="https://p2peace.github.io/js/reveal.js/css/theme/night.css" id="theme"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section>
<h1>p2peace</h1>
<h2>p2peace</h2>
<h2><a href="mailto:"></a></h2>
<h2><span class="timestamp-wrapper"><span class="timestamp">&lt;2015-09-28 月&gt;</span></span></h2></section>
<section>
<h2>Table of Contents</h2><ul>
<li>
<a href="#sec-1">p2peace</a>
<ul>
<li>
<a href="#sec-1-1">summary</a>
</li>
</ul>
<li>
<a href="#sec-2">the problem</a>
<ul>
<li>
<a href="#sec-2-1">physical security</a>
</li>
</ul>
<li>
<a href="#sec-3">the solution</a>
<ul>
<li>
<a href="#sec-3-1">components</a>
</li>
</ul>
<li>
<a href="#sec-4">culture</a>
</li>
<li>
<a href="#sec-5">technical</a>
</li>
</ul>
</section>

<section>
<section id="sec-1" >

<h2>p2peace</h2>
</section>
<section id="sec-1-1" >

<h3>summary</h3>
<ul class="org-ul">
<li>Divided we fall, united we're fascists: Can we be protected in an
innocence-preserving manner?
</li>
</ul>
</section>

</section>
<section>
<section id="sec-2" >

<h2>the problem</h2>
</section>
<section id="sec-2-1" >

<h3>physical security</h3>
<ul class="org-ul">
<li>Physical security sucks whether you're rich or poor
</li>

<li>The rich live in a condo [or a similar allegedely-protected space]. A
"security" company installs cameras and alarm systems all over the place (a
huge intel/paedo source, mind you) and are physically protected by an armed
guard at thr lobby, This can deter common criminal (heads up: "uncommon" ones
are not affected: <a href="https://archive.is/i6HcP#selection-357.0-365.44">https://archive.is/i6HcP#selection-357.0-365.44</a> ], but fails
miserably once so-called social order collapses [e.g. a civil war]: the guard
at the gate is either from the losing side (i.e. dead, or hiding in the
mountains) or worse [i.e. looting the premises].
</li>

<li>The poor get the short end of the stick (unless they win a civil
war :p). They're either "protected" by the police (serving the rich) or [if
social order allows it] a gang [at least they're also protected from tax
collectors]. If they try to organize in order to defend themselves, they're
either a gang (threatened by both the state and rivaling gangs) or worse:
someone declares them a "terrorist group" and then even the Magna Carta stops
protecting them.
</li>
</ul>

<p>
TL;DR - in order to be safe, you should be violent motherfokker (which is
dangerous to your mental health).
</p>
</section>

</section>
<section>
<section id="sec-3" >

<h2>the solution</h2>
<p>
Everyone well-versed in 70s Kung Fu movies knows that when a village is being
harassed by bandits. the last thing you want to do is appeal to the
emperor. What you get is soldiers looting and raping you instead of bandits (who
are at least a bit afraid of the law.
</p>

<p>
The proper solution according to that narrative is for the peasants to practice
Kung Fu. Since people are lazy, bandits should cause a "critical mass" of
discomfort in order to be arsed to train.
</p>

<p>
Despite the shortcomings of this method, it is more profound (as long as we're
talking about proper Kung Fu training (and not arm-the-poor schemes like the
"Free" Syrian Army or even sicker experiments like Somalia). If you "learn to
figh like any good boy should" [
<a href="https://www.youtube.com/watch?v=7xvRdcwyvH0&t=46">https://www.youtube.com/watch?v=7xvRdcwyvH0&t=46</a> (fuck German copyright
mafia. Listen to the original if you live in the free world)], your goal is to
avoid conflict. No "smart weapon" can teach you that (lazy peasants).
</p>

</section>
<section id="sec-3-1" >

<h3>components</h3>
<ul class="org-ul">
<li>cultural:
</li>
<li>technical:
</li>
</ul>
</section>

</section>
<section>
<section id="sec-4" >

<h2>culture</h2>
</section>

</section>
<section>
<section id="sec-5" >

<h2>technical</h2>
</section>
</section>
</div>
</div>

<script src="https://p2peace.github.io/js/reveal.js/lib/js/head.min.js"></script>
<script src="https://p2peace.github.io/js/reveal.js/js/reveal.min.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: true,
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'fade', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://p2peace.github.io/js/reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: 'https://p2peace.github.io/js/reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://p2peace.github.io/js/reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: 'https://p2peace.github.io/js/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } },
 { src: 'https://p2peace.github.io/js/reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: 'https://p2peace.github.io/js/reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }
]
});
</script>
</body>
</html>
